#include<stdio.h>
#include<iostream.h>
#include<string.h>
#include<stdlib.h>
#include<dir.h>
#include<conio.h>
#define F 17 // Длина наименования товара
#define T 27 // Длина названия производителя
// Создание шаблона структур типа Wert
struct Wert
{
	unsigned char n[F];
	int q;
	float p;
	int t;
	unsigned char prod[T];
};
#include"..\\h\\wind.h"
#include"..\\h\\page_1.h"
#include"..\\h\\24_line.h"
#include"..\\h\\24_print.h"
#include"..\\h\\24_file.h"
void main()
{
	page_1();
	_setcursortype(_NOCURSOR);
	window(1, 1, 80, 25); textattr(15 + (7 << 4)); clrscr();
	Wind(3, 3, 76, 21, 0, 1);
	char  *name = "..\\fil_dat\\pr24_VVV.dat";
	int col;
	// Массив структур goods длиной списка MAXN
	const int N = 16;
	struct Wert goods[N] =
	{
		"Пискаревское", 23, 39.90, 11, "Пискаревский молзавод",
		"Снежок", 25, 47.40, 4, "Лактис",
		"ЭГО", 80, 43.90, 3, "Павловский молзавод",
		"Приневское", 35, 44.00, 5, "Приневское",
		"Высоко Высоко", 47, 44.90, 1, "Городской молочный завод 2",
		"За вредность", 25, 95.90, 2, "Дашенька",
		"Княгинино", 24, 54.90, 2, "Княгининское молоко",
		"Гармония", 34, 46.60, 7, "Лакто-Новгород",
		"Полная крынка", 45, 29.90, 7, "Кривское",
		"Молочное царство", 65, 23.90, 7, "Тверца",
		"Семейная ферма", 34, 42.00, 3, "Ручьи",
		"Просто", 32, 75.90, 8, "Дельта",
		"Молочная", 23, 75.90, 9, "МТЗ КампоМос",
		"Телячья", 25, 74.90, 11, "Великолукский мясокомбинат",
		"Докторская", 25, 77.00, 12, "Царицыно"
	};
	col = fil_struct(goods, name);
	print_struct(goods, col);
	getch();
}